//
//  BasicKnot.swift
//  Dorae
//
//  Created by 지영 on 5/20/24.
//

import Foundation

// 기본(매듭이름: 매듭이름, 매듭이미지: 매듭이미지, 귀: [String]?)
let 도래매듭 = 기본(매듭이름: .도래매듭, 매듭이미지: .도래매듭)
let 귀도래매듭 = 기본(매듭이름: .귀도래매듭, 매듭이미지: .귀도래매듭, 귀: Array(repeating: "", count: 1))
let 단추매듭 = 기본(매듭이름: .단추매듭, 매듭이미지: .단추매듭)
let 가락지매듭 = 기본(매듭이름: .가락지매듭, 매듭이미지: .가락지매듭)
let 생쪽매듭 = 기본(매듭이름: .생쪽매듭, 매듭이미지: .생쪽매듭, 귀: Array(repeating: "", count: 1))
let 나비매듭 = 기본(매듭이름: .나비매듭, 매듭이미지: .나비매듭, 귀: Array(repeating: "", count: 1))
let 거꾸로나비매듭 = 기본(매듭이름: .거꾸로나비매듭, 매듭이미지: .거꾸로나비매듭, 귀: Array(repeating: "", count: 1))
let 두벌매화 = 기본(매듭이름: .두벌매화, 매듭이미지: .두벌매화, 귀: Array(repeating: "", count: 2))
let 세벌매화 = 기본(매듭이름: .세벌매화, 매듭이미지: .세벌매화, 귀: Array(repeating: "", count: 3))
let 두벌국화 = 기본(매듭이름: .두벌국화, 매듭이미지: .두벌국화, 귀: Array(repeating: "", count: 3))
let 세벌국화 = 기본(매듭이름: .세벌국화, 매듭이미지: .세벌국화, 귀: Array(repeating: "", count: 5))
let 네벌국화 = 기본(매듭이름: .네벌국화, 매듭이미지: .네벌국화, 귀: Array(repeating: "", count: 7))
let 다섯벌국화 = 기본(매듭이름: .다섯벌국화, 매듭이미지: .다섯벌국화, 귀: Array(repeating: "", count: 9))
let 병아리매듭 = 기본(매듭이름: .병아리매듭, 매듭이미지: .병아리매듭, 귀: Array(repeating: "", count: 2))
let 잠자리매듭 = 기본(매듭이름: .잠자리매듭, 매듭이미지: .잠자리매듭)
let 동심결매듭 = 기본(매듭이름: .동심결매듭, 매듭이미지: .동심결매듭, 귀: Array(repeating: "", count: 2))
let 안경매듭 = 기본(매듭이름: .안경매듭, 매듭이미지: .안경매듭)
let 장구매듭 = 기본(매듭이름: .장구매듭, 매듭이미지: .장구매듭, 귀: Array(repeating: "", count: 1))
let 가지방석매듭 = 기본(매듭이름: .가지방석매듭, 매듭이미지: .가지방석매듭)
let 귀달린가지방석매듭 = 기본(매듭이름: .귀달린가지방석매듭, 매듭이미지: .귀달린가지방석매듭)
let 딸기매듭 = 기본(매듭이름: .딸기매듭, 매듭이미지: .딸기매듭)
let 석씨매듭 = 기본(매듭이름: .석씨매듭, 매듭이미지: .석씨매듭)
let 꼰디기매듭 = 기본(매듭이름: .꼰디기매듭, 매듭이미지: .꼰디기매듭)
let 매미매듭 = 기본(매듭이름: .매미매듭, 매듭이미지: .매미매듭)
let 사색판매듭 = 기본(매듭이름: .사색판매듭, 매듭이미지: .사색판매듭)

let 기본매듭모음: [기본] = [
    도래매듭,
    귀도래매듭,
    단추매듭,
    가락지매듭,
    생쪽매듭,
    나비매듭,
    거꾸로나비매듭,
    두벌매화,
    세벌매화,
    두벌국화,
    세벌국화,
    네벌국화,
    다섯벌국화,
    병아리매듭,
    잠자리매듭,
    동심결매듭,
    안경매듭,
    장구매듭,
    가지방석매듭,
    귀달린가지방석매듭,
    딸기매듭,
    석씨매듭,
    꼰디기매듭,
    매미매듭,
    사색판매듭
]

